In [0]:
"""
In this notebook, i collected utility methods i used in data cleaning with pandas.
"""

import pandas as pd 
import numpy as np 
  
# Create dictionary 
dictionary = {"Country":["Italy", "France", "England", "Germany", "Japan"], 
        	  "Population(m)": [60, 1.65, 83, np.nan, 120], 
     	        'Area':[301, 643, np.nan, 357, 377]} 
  
# Convert dictionary to dataframe 
df = pd.DataFrame(dictionary)

In [0]:
df

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England          83.00    NaN
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
#Missing values by column
df.isnull().values

array([[False, False, False],
       [False, False, False],
       [False, False,  True],
       [False,  True, False],
       [False, False, False]])

In [0]:
df.isnull().sum()

Country          0
Population(m)    1
Area             1
dtype: int64

In [0]:
#Fill missing values with value
df.fillna(1)

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England          83.00    1.0
3  Germany           1.00  357.0
4    Japan         120.00  377.0

In [0]:
df["Area"].fillna(2)

0    301.0
1    643.0
2      2.0
3    357.0
4    377.0
Name: Area, dtype: float64

In [0]:
#Only change target column
df1 = df.copy()
df1["Area"] = df["Area"].fillna(4)
df1

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England          83.00    4.0
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
#Assign mean for missing values
df1 = df.copy()
print("mean : ", df1["Area"].mean())
df1["Area"] = df1["Area"].fillna( df1["Area"].mean() )
df1

mean :  419.5

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England          83.00  419.5
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
#Assign interpolate for missing values
df1 = df.copy()
print("interpolate : ", df1["Area"].interpolate())
df1["Area"] = df1["Area"].fillna( df1["Area"].interpolate() )
df1

interpolate :  0    301.0
1    643.0
2    500.0
3    357.0
4    377.0
Name: Area, dtype: float64

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England          83.00  500.0
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
#Drop missing rows
df1 = df.copy()
df1.dropna()

  Country  Population(m)   Area
0   Italy          60.00  301.0
1  France           1.65  643.0
4   Japan         120.00  377.0

In [0]:
#Drop missing rows of specific column
df1 = df.copy()
df1["Area2"] = df1["Area"].dropna()
df1

   Country  Population(m)   Area  Area2
0    Italy          60.00  301.0  301.0
1   France           1.65  643.0  643.0
2  England          83.00    NaN    NaN
3  Germany            NaN  357.0  357.0
4    Japan         120.00  377.0  377.0

In [0]:
df1["Area"].dropna()

0    301.0
1    643.0
3    357.0
4    377.0
Name: Area, dtype: float64

In [0]:
df1 = df.copy()
df1 = df1[df1['Area'].notna()]
df1

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
df1 = df.copy()
print(type(df1['Area'].notna()))
df1['Area'].notna()

<class 'pandas.core.series.Series'>

0     True
1     True
2    False
3     True
4     True
Name: Area, dtype: bool

In [0]:
df1 = df.copy()
df1 = df1.dropna(subset=['Area'])
df1

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
df1 = df.copy()
df1.dropna(subset=['Area'], how='all', inplace=True)
df1

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
3  Germany            NaN  357.0
4    Japan         120.00  377.0

In [0]:
import pandas as pd 
import numpy as np 
  
# Create dictionary with more noise - and x
dictionary = {"Country":["Italy", "France", "England", "Germany", "Japan"], 
        	  "Population(m)": [60, 1.65, "-", np.nan, 120], 
     	        'Area':[301, 643, np.nan, "x", 377]} 
  
# Convert dictionary to dataframe 
df2 = pd.DataFrame(dictionary)

In [0]:
df2

   Country Population(m) Area
0    Italy            60  301
1   France          1.65  643
2  England             -  NaN
3  Germany           NaN    x
4    Japan           120  377

In [0]:
df2.isnull()

   Country  Population(m)   Area
0    False          False  False
1    False          False  False
2    False          False   True
3    False           True  False
4    False          False  False

In [0]:
#Replace some values with nan for easy processing
df3 = df2.copy()
df3 = df3.replace(["-","x"],np.nan)
df3

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England            NaN    NaN
3  Germany            NaN    NaN
4    Japan         120.00  377.0

In [0]:
#Replace some values with specific value
df3 = df2.copy()
df3 = df3.replace(["-","x"],111)
df3

   Country  Population(m)   Area
0    Italy          60.00  301.0
1   France           1.65  643.0
2  England         111.00    NaN
3  Germany            NaN  111.0
4    Japan         120.00  377.0

In [0]:
#Replace column values with list comprehension
df3 = df2.copy()
df3["Country"] = [ "Country "+ x for x in df3["Country"]]
df3

           Country Population(m) Area
0    Country Italy            60  301
1   Country France          1.65  643
2  Country England             -  NaN
3  Country Germany           NaN    x
4    Country Japan           120  377

In [0]:
#Replace column values with fucntion
def to_country(s):
  return s + " Country"

df3 = df2.copy()
df3["Country"] = [  to_country(x) for x in df3["Country"]]
df3

           Country Population(m) Area
0    Italy Country            60  301
1   France Country          1.65  643
2  England Country             -  NaN
3  Germany Country           NaN    x
4    Japan Country           120  377

In [0]:
#Replace column values with lambda
df3 = df2.copy()
df3["Country"] = df3["Country"].map(lambda x : "County" + x)
df3

         Country Population(m) Area
0    CountyItaly            60  301
1   CountyFrance          1.65  643
2  CountyEngland             -  NaN
3  CountyGermany           NaN    x
4    CountyJapan           120  377

In [0]:
#Replace column values with a function defined on column
df3 = df2.copy()
df3["Country"] = df3["Country"].str.lower()
df3

   Country Population(m) Area
0    italy            60  301
1   france          1.65  643
2  england             -  NaN
3  germany           NaN    x
4    japan           120  377

In [0]:
#Replace column values with a value
df3 = df2.copy()
df3["Area"].fillna(1,inplace=True)
df3

   Country Population(m) Area
0    Italy            60  301
1   France          1.65  643
2  England             -    1
3  Germany           NaN    x
4    Japan           120  377

In [0]:
#Inplace replace for columns
df3 = df2.copy()
df3["Country"].replace(inplace=True,to_replace="England" , value="Britain")
df3

   Country Population(m) Area
0    Italy            60  301
1   France          1.65  643
2  Britain             -  NaN
3  Germany           NaN    x
4    Japan           120  377

In [0]:
#NOT Inplace replace for columns
df3 = df2.copy()
df3["Country2"] = df3["Country"].replace(inplace=False,to_replace="England" , value="Britain")
df3

   Country Population(m) Area Country2
0    Italy            60  301    Italy
1   France          1.65  643   France
2  England             -  NaN  Britain
3  Germany           NaN    x  Germany
4    Japan           120  377    Japan

In [0]:
date = pd.to_datetime("May 22, 2019")

In [0]:
date

Timestamp('2019-05-22 00:00:00')

In [0]:
date = pd.to_datetime("20052019",format="%d%m%Y")
date

Timestamp('2019-05-20 00:00:00')

In [0]:
date = pd.to_datetime("20190520",format="%Y%m%d")
date

Timestamp('2019-05-20 00:00:00')